[Killed] BlockStatement
src/domain/entities/Invoice.js:9:132
 };
 
 export class Invoice {
-  constructor({ id, number, date, status = InvoiceStatus.DRAFT, clientId, lines, totalExcludingTax, totalVat, totalIncludingTax }) {
-    this.validate({ lines, clientId });
-
-    this.id = id;
-    this.number = number;
-    this.date = date || new Date().toISOString();
-    this.status = status;
-    this.clientId = clientId;
-    this.lines = lines.map(line => line instanceof InvoiceLine ? line : new InvoiceLine(line));
-    this.totalExcludingTax = totalExcludingTax || 0;
-    this.totalVat = totalVat || 0;
-    this.totalIncludingTax = totalIncludingTax || 0;
-  }
+  constructor({ id, number, date, status = InvoiceStatus.DRAFT, clientId, lines, totalExcludingTax, totalVat, totalIncludingTax }) {}
 
   validate({ lines, clientId }) {
killedBy: GetRevenue should calculate revenue for paid invoices in period
statusReason: expected NaN to be 360 // Object.is equality

[Killed] ConditionalExpression
src/domain/entities/Invoice.js:14:17
 
     this.id = id;
     this.number = number;
-    this.date = date || new Date().toISOString();
+    this.date = true;
     this.status = status;
     this.clientId = clientId;
killedBy: Invoices API E2E GET /api/invoices/revenue should calculate revenue for period
statusReason: expected { startDate: '2025-01-01', …(3) } to match object { startDate: '2025-01-01', …(2) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/domain/entities/Invoice.js:14:17
 
     this.id = id;
     this.number = number;
-    this.date = date || new Date().toISOString();
+    this.date = false;
     this.status = status;
     this.clientId = clientId;
killedBy: Invoices API E2E GET /api/invoices/revenue should calculate revenue for period
statusReason: expected { startDate: '2025-01-01', …(3) } to match object { startDate: '2025-01-01', …(2) }
(1 matching property omitted from actual)

[Killed] ArrowFunction
src/domain/entities/Invoice.js:17:28
     this.date = date || new Date().toISOString();
     this.status = status;
     this.clientId = clientId;
-    this.lines = lines.map(line => line instanceof InvoiceLine ? line : new InvoiceLine(line));
+    this.lines = lines.map(() => undefined);
     this.totalExcludingTax = totalExcludingTax || 0;
     this.totalVat = totalVat || 0;
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected 400 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/domain/entities/Invoice.js:18:30
     this.status = status;
     this.clientId = clientId;
     this.lines = lines.map(line => line instanceof InvoiceLine ? line : new InvoiceLine(line));
-    this.totalExcludingTax = totalExcludingTax || 0;
+    this.totalExcludingTax = false;
     this.totalVat = totalVat || 0;
     this.totalIncludingTax = totalIncludingTax || 0;
killedBy: Invoice toJSON should serialize invoice to JSON
statusReason: expected { id: '123', …(8) } to match object { id: '123', …(6) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/domain/entities/Invoice.js:18:30
     this.status = status;
     this.clientId = clientId;
     this.lines = lines.map(line => line instanceof InvoiceLine ? line : new InvoiceLine(line));
-    this.totalExcludingTax = totalExcludingTax || 0;
+    this.totalExcludingTax = totalExcludingTax && 0;
     this.totalVat = totalVat || 0;
     this.totalIncludingTax = totalIncludingTax || 0;
killedBy: Invoice toJSON should serialize invoice to JSON
statusReason: expected { id: '123', …(8) } to match object { id: '123', …(6) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/domain/entities/Invoice.js:19:21
     this.clientId = clientId;
     this.lines = lines.map(line => line instanceof InvoiceLine ? line : new InvoiceLine(line));
     this.totalExcludingTax = totalExcludingTax || 0;
-    this.totalVat = totalVat || 0;
+    this.totalVat = totalVat && 0;
     this.totalIncludingTax = totalIncludingTax || 0;
   }
killedBy: Invoice toJSON should serialize invoice to JSON
statusReason: expected { id: '123', …(8) } to match object { id: '123', …(6) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/domain/entities/Invoice.js:19:21
     this.clientId = clientId;
     this.lines = lines.map(line => line instanceof InvoiceLine ? line : new InvoiceLine(line));
     this.totalExcludingTax = totalExcludingTax || 0;
-    this.totalVat = totalVat || 0;
+    this.totalVat = false;
     this.totalIncludingTax = totalIncludingTax || 0;
   }
killedBy: Invoice toJSON should serialize invoice to JSON
statusReason: expected { id: '123', …(8) } to match object { id: '123', …(6) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/domain/entities/Invoice.js:20:30
     this.lines = lines.map(line => line instanceof InvoiceLine ? line : new InvoiceLine(line));
     this.totalExcludingTax = totalExcludingTax || 0;
     this.totalVat = totalVat || 0;
-    this.totalIncludingTax = totalIncludingTax || 0;
+    this.totalIncludingTax = totalIncludingTax && 0;
   }
 
killedBy: Invoice toJSON should serialize invoice to JSON
statusReason: expected { id: '123', …(8) } to match object { id: '123', …(6) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/domain/entities/Invoice.js:20:30
     this.lines = lines.map(line => line instanceof InvoiceLine ? line : new InvoiceLine(line));
     this.totalExcludingTax = totalExcludingTax || 0;
     this.totalVat = totalVat || 0;
-    this.totalIncludingTax = totalIncludingTax || 0;
+    this.totalIncludingTax = true;
   }
 
killedBy: Invoice toJSON should serialize invoice to JSON
statusReason: expected { id: '123', …(8) } to match object { id: '123', …(6) }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/domain/entities/Invoice.js:23:33
     this.totalIncludingTax = totalIncludingTax || 0;
   }
 
-  validate({ lines, clientId }) {
-    if (!clientId || typeof clientId !== 'string') {
-      throw new Error('Client ID is required');
-    }
-    if (!Array.isArray(lines) || lines.length === 0) {
-      throw new Error('Invoice must have at least one line');
-    }
-  }
+  validate({ lines, clientId }) {}
 
   markAsPaid() {
killedBy: Invoice constructor should throw error without clientId
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/domain/entities/Invoice.js:24:22
   }
 
   validate({ lines, clientId }) {
-    if (!clientId || typeof clientId !== 'string') {
+    if (!clientId || false) {
       throw new Error('Client ID is required');
     }
killedBy: Invoice constructor should throw error with non-string clientId
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/domain/entities/Invoice.js:24:9
   }
 
   validate({ lines, clientId }) {
-    if (!clientId || typeof clientId !== 'string') {
+    if (true) {
       throw new Error('Client ID is required');
     }
killedBy: Invoice constructor should create invoice with valid data
statusReason: Client ID is required

[Killed] ConditionalExpression
src/domain/entities/Invoice.js:27:34
     if (!clientId || typeof clientId !== 'string') {
       throw new Error('Client ID is required');
     }
-    if (!Array.isArray(lines) || lines.length === 0) {
+    if (!Array.isArray(lines) || false) {
       throw new Error('Invoice must have at least one line');
     }
killedBy: Invoice constructor should throw error without lines
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/domain/entities/Invoice.js:27:54
     if (!clientId || typeof clientId !== 'string') {
       throw new Error('Client ID is required');
     }
-    if (!Array.isArray(lines) || lines.length === 0) {
-      throw new Error('Invoice must have at least one line');
-    }
+    if (!Array.isArray(lines) || lines.length === 0) {}
   }
 
killedBy: Invoice constructor should throw error without lines
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/domain/entities/Invoice.js:32:16
     }
   }
 
-  markAsPaid() {
-    if (this.status === InvoiceStatus.PAID) {
-      throw new Error('Invoice is already paid');
-    }
-    this.status = InvoiceStatus.PAID;
-  }
+  markAsPaid() {}
 
   isDraft() {
killedBy: Invoice markAsPaid should change status from DRAFT to PAID
statusReason: expected 'DRAFT' to be 'PAID' // Object.is equality

[Killed] ConditionalExpression
src/domain/entities/Invoice.js:33:9
   }
 
   markAsPaid() {
-    if (this.status === InvoiceStatus.PAID) {
+    if (false) {
       throw new Error('Invoice is already paid');
     }
killedBy: Invoice markAsPaid should throw error if already paid
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/domain/entities/Invoice.js:33:45
   }
 
   markAsPaid() {
-    if (this.status === InvoiceStatus.PAID) {
-      throw new Error('Invoice is already paid');
-    }
+    if (this.status === InvoiceStatus.PAID) {}
     this.status = InvoiceStatus.PAID;
   }
killedBy: Invoice markAsPaid should throw error if already paid
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/domain/entities/Invoice.js:39:13
     this.status = InvoiceStatus.PAID;
   }
 
-  isDraft() {
-    return this.status === InvoiceStatus.DRAFT;
-  }
+  isDraft() {}
 
   isPaid() {
killedBy: Invoice status checks should correctly identify draft invoice
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/domain/entities/Invoice.js:40:12
   }
 
   isDraft() {
-    return this.status === InvoiceStatus.DRAFT;
+    return this.status !== InvoiceStatus.DRAFT;
   }
 
killedBy: Invoice status checks should correctly identify draft invoice
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/domain/entities/Invoice.js:40:12
   }
 
   isDraft() {
-    return this.status === InvoiceStatus.DRAFT;
+    return true;
   }
 
killedBy: Invoice status checks should correctly identify paid invoice
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/domain/entities/Invoice.js:43:12
     return this.status === InvoiceStatus.DRAFT;
   }
 
-  isPaid() {
-    return this.status === InvoiceStatus.PAID;
-  }
+  isPaid() {}
 
   setTotals(totalExcludingTax, totalVat, totalIncludingTax) {
killedBy: Invoice status checks should correctly identify draft invoice
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/domain/entities/Invoice.js:44:12
   }
 
   isPaid() {
-    return this.status === InvoiceStatus.PAID;
+    return false;
   }
 
killedBy: Invoice status checks should correctly identify paid invoice
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/domain/entities/Invoice.js:44:12
   }
 
   isPaid() {
-    return this.status === InvoiceStatus.PAID;
+    return this.status !== InvoiceStatus.PAID;
   }
 
killedBy: Invoice status checks should correctly identify draft invoice
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/domain/entities/Invoice.js:47:61
     return this.status === InvoiceStatus.PAID;
   }
 
-  setTotals(totalExcludingTax, totalVat, totalIncludingTax) {
-    this.totalExcludingTax = totalExcludingTax;
-    this.totalVat = totalVat;
-    this.totalIncludingTax = totalIncludingTax;
-  }
+  setTotals(totalExcludingTax, totalVat, totalIncludingTax) {}
 
   toJSON() {
killedBy: Invoice setTotals should set invoice totals
statusReason: expected +0 to be 200 // Object.is equality

[Killed] BlockStatement
src/domain/entities/Invoice.js:53:12
     this.totalIncludingTax = totalIncludingTax;
   }
 
-  toJSON() {
-    return {
-      id: this.id,
-      number: this.number,
-      date: this.date,
-      status: this.status,
-      clientId: this.clientId,
-      lines: this.lines.map(line => line.toJSON()),
-      totalExcludingTax: this.totalExcludingTax,
-      totalVat: this.totalVat,
-      totalIncludingTax: this.totalIncludingTax
-    };
-  }
+  toJSON() {}
 }
 
killedBy: Invoice toJSON should serialize invoice to JSON
statusReason: expected undefined to match object { id: '123', …(6) }

[Killed] ArrowFunction
src/domain/entities/Invoice.js:60:29
       date: this.date,
       status: this.status,
       clientId: this.clientId,
-      lines: this.lines.map(line => line.toJSON()),
+      lines: this.lines.map(() => undefined),
       totalExcludingTax: this.totalExcludingTax,
       totalVat: this.totalVat,
killedBy: Invoice toJSON should serialize invoice to JSON
statusReason: Cannot convert undefined or null to object
