[Killed] BlockStatement
src/application/usecases/CreateInvoice.js:5:52
 import { InvoiceCalculator } from '../../domain/services/InvoiceCalculator.js';
 
 export class CreateInvoice {
-  constructor(invoiceRepository, clientRepository) {
-    this.invoiceRepository = invoiceRepository;
-    this.clientRepository = clientRepository;
-    this.calculator = new InvoiceCalculator();
-  }
+  constructor(invoiceRepository, clientRepository) {}
 
   async execute({ clientId, lines }) {
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected 400 to be 201 // Object.is equality

[Killed] BlockStatement
src/application/usecases/CreateInvoice.js:11:38
     this.calculator = new InvoiceCalculator();
   }
 
-  async execute({ clientId, lines }) {
-    const client = await this.clientRepository.findById(clientId);
-    if (!client) {
-      throw new Error('Client not found');
-    }
-
-    const year = new Date().getFullYear();
-    const invoiceNumber = await this.invoiceRepository.getNextInvoiceNumber(year);
-
-    const invoice = new Invoice({
-      id: this.invoiceRepository.getNextId(),
-      number: invoiceNumber,
-      date: new Date().toISOString(),
-      clientId,
-      lines
-    });
-
-    const totals = this.calculator.calculateInvoiceTotals(invoice);
-    invoice.setTotals(totals.totalExcludingTax, totals.totalVat, totals.totalIncludingTax);
-
-    await this.invoiceRepository.save(invoice);
-
-    return invoice;
-  }
+  async execute({ clientId, lines }) {}
 }
 
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected 400 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/application/usecases/CreateInvoice.js:13:9
 
   async execute({ clientId, lines }) {
     const client = await this.clientRepository.findById(clientId);
-    if (!client) {
+    if (false) {
       throw new Error('Client not found');
     }
killedBy: Invoices API E2E POST /api/invoices should return 400 for invalid client
statusReason: expected 201 to be 400 // Object.is equality

[Killed] BooleanLiteral
src/application/usecases/CreateInvoice.js:13:9
 
   async execute({ clientId, lines }) {
     const client = await this.clientRepository.findById(clientId);
-    if (!client) {
+    if (client) {
       throw new Error('Client not found');
     }
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected 400 to be 201 // Object.is equality
