[Killed] BlockStatement
src/application/usecases/GetInvoice.js:2:34
 export class GetInvoice {
-  constructor(invoiceRepository) {
-    this.invoiceRepository = invoiceRepository;
-  }
+  constructor(invoiceRepository) {}
 
   async execute(invoiceId) {
killedBy: Invoices API E2E GET /api/invoices/:id should retrieve an invoice by id
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/application/usecases/GetInvoice.js:6:28
     this.invoiceRepository = invoiceRepository;
   }
 
-  async execute(invoiceId) {
-    const invoice = await this.invoiceRepository.findById(invoiceId);
-    if (!invoice) {
-      throw new Error('Invoice not found');
-    }
-    return invoice;
-  }
+  async execute(invoiceId) {}
 }
 
killedBy: Invoices API E2E GET /api/invoices/:id should retrieve an invoice by id
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/application/usecases/GetInvoice.js:8:9
 
   async execute(invoiceId) {
     const invoice = await this.invoiceRepository.findById(invoiceId);
-    if (!invoice) {
+    if (invoice) {
       throw new Error('Invoice not found');
     }
killedBy: Invoices API E2E GET /api/invoices/:id should retrieve an invoice by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/application/usecases/GetInvoice.js:8:9
 
   async execute(invoiceId) {
     const invoice = await this.invoiceRepository.findById(invoiceId);
-    if (!invoice) {
+    if (true) {
       throw new Error('Invoice not found');
     }
killedBy: Invoices API E2E GET /api/invoices/:id should retrieve an invoice by id
statusReason: expected 404 to be 200 // Object.is equality
