[Killed] BlockStatement
src/application/usecases/GetRevenue.js:4:34
 import { InvoiceStatus } from '../../domain/entities/Invoice.js';
 
 export class GetRevenue {
-  constructor(invoiceRepository) {
-    this.invoiceRepository = invoiceRepository;
-  }
+  constructor(invoiceRepository) {}
 
   async execute({ startDate, endDate }) {
killedBy: Invoices API E2E GET /api/invoices/revenue should calculate revenue for period
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/application/usecases/GetRevenue.js:8:41
     this.invoiceRepository = invoiceRepository;
   }
 
-  async execute({ startDate, endDate }) {
-    if (!startDate || !endDate) {
-      throw new Error('Start date and end date are required');
-    }
-
-    const invoices = await this.invoiceRepository.findByFilters({
-      status: InvoiceStatus.PAID,
-      startDate,
-      endDate
-    });
-
-    const revenue = invoices.reduce((total, invoice) => {
-      return total + invoice.totalIncludingTax;
-    }, 0);
-
-    return {
-      startDate,
-      endDate,
-      totalRevenue: Math.round(revenue * 100) / 100,
-      invoiceCount: invoices.length
-    };
-  }
+  async execute({ startDate, endDate }) {}
 }
 
killedBy: Invoices API E2E GET /api/invoices/revenue should calculate revenue for period
statusReason: expected '' to match object { startDate: '2025-01-01', …(2) }

[Killed] BlockStatement
src/application/usecases/GetRevenue.js:9:33
   }
 
   async execute({ startDate, endDate }) {
-    if (!startDate || !endDate) {
-      throw new Error('Start date and end date are required');
-    }
+    if (!startDate || !endDate) {}
 
     const invoices = await this.invoiceRepository.findByFilters({
killedBy: GetRevenue should throw error without startDate
statusReason: expected [Function] to throw error including 'Start date and end date are required' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/application/usecases/GetRevenue.js:9:9
   }
 
   async execute({ startDate, endDate }) {
-    if (!startDate || !endDate) {
+    if (false) {
       throw new Error('Start date and end date are required');
     }
killedBy: GetRevenue should throw error without startDate
statusReason: expected [Function] to throw error including 'Start date and end date are required' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/application/usecases/GetRevenue.js:19:57
       endDate
     });
 
-    const revenue = invoices.reduce((total, invoice) => {
-      return total + invoice.totalIncludingTax;
-    }, 0);
+    const revenue = invoices.reduce((total, invoice) => {}, 0);
 
     return {
killedBy: GetRevenue should calculate revenue for paid invoices in period
statusReason: expected NaN to be 360 // Object.is equality

[Killed] ArithmeticOperator
src/application/usecases/GetRevenue.js:20:14
     });
 
     const revenue = invoices.reduce((total, invoice) => {
-      return total + invoice.totalIncludingTax;
+      return total - invoice.totalIncludingTax;
     }, 0);
 
killedBy: Invoices API E2E GET /api/invoices/revenue should calculate revenue for period
statusReason: expected -120 to be greater than 0

[Killed] ObjectLiteral
src/application/usecases/GetRevenue.js:23:12
       return total + invoice.totalIncludingTax;
     }, 0);
 
-    return {
-      startDate,
-      endDate,
-      totalRevenue: Math.round(revenue * 100) / 100,
-      invoiceCount: invoices.length
-    };
+    return {};
   }
 }
killedBy: GetRevenue should calculate revenue for paid invoices in period
statusReason: expected undefined to be 360 // Object.is equality

[Killed] ArithmeticOperator
src/application/usecases/GetRevenue.js:26:32
     return {
       startDate,
       endDate,
-      totalRevenue: Math.round(revenue * 100) / 100,
+      totalRevenue: Math.round(revenue / 100) / 100,
       invoiceCount: invoices.length
     };
killedBy: Invoices API E2E Complete workflow should handle complete invoice lifecycle
statusReason: expected 0.03 to be 295 // Object.is equality

[Killed] ArithmeticOperator
src/application/usecases/GetRevenue.js:26:21
     return {
       startDate,
       endDate,
-      totalRevenue: Math.round(revenue * 100) / 100,
+      totalRevenue: Math.round(revenue * 100) * 100,
       invoiceCount: invoices.length
     };
killedBy: GetRevenue should calculate revenue for paid invoices in period
statusReason: expected 3600000 to be 360 // Object.is equality
