[Killed] BlockStatement
src/application/usecases/ListInvoices.js:2:34
 export class ListInvoices {
-  constructor(invoiceRepository) {
-    this.invoiceRepository = invoiceRepository;
-  }
+  constructor(invoiceRepository) {}
 
   async execute(filters = {}) {
killedBy: ListInvoices should call findAll when no filters provided
statusReason: Cannot read properties of undefined (reading 'findAll')

[Killed] BlockStatement
src/application/usecases/ListInvoices.js:6:31
     this.invoiceRepository = invoiceRepository;
   }
 
-  async execute(filters = {}) {
-    const { status, startDate, endDate, clientId } = filters;
-
-    if (status || startDate || endDate || clientId) {
-      return await this.invoiceRepository.findByFilters({
-        status,
-        startDate,
-        endDate,
-        clientId
-      });
-    }
-
-    return await this.invoiceRepository.findAll();
-  }
+  async execute(filters = {}) {}
 }
 
killedBy: ListInvoices should call findAll when no filters provided
statusReason: expected undefined to be [ { id: '1' }, { id: '2' } ] // Object.is equality

[Killed] LogicalOperator
src/application/usecases/ListInvoices.js:9:9
   async execute(filters = {}) {
     const { status, startDate, endDate, clientId } = filters;
 
-    if (status || startDate || endDate || clientId) {
+    if (status && startDate || endDate || clientId) {
       return await this.invoiceRepository.findByFilters({
         status,
killedBy: ListInvoices should call findByFilters when status is provided
statusReason: expected [] to be [ { id: '1', status: 'PAID' } ] // Object.is equality

[Killed] LogicalOperator
src/application/usecases/ListInvoices.js:9:9
   async execute(filters = {}) {
     const { status, startDate, endDate, clientId } = filters;
 
-    if (status || startDate || endDate || clientId) {
+    if ((status || startDate || endDate) && clientId) {
       return await this.invoiceRepository.findByFilters({
         status,
killedBy: ListInvoices should call findByFilters when status is provided
statusReason: expected [] to be [ { id: '1', status: 'PAID' } ] // Object.is equality

[Killed] ObjectLiteral
src/application/usecases/ListInvoices.js:10:57
     const { status, startDate, endDate, clientId } = filters;
 
     if (status || startDate || endDate || clientId) {
-      return await this.invoiceRepository.findByFilters({
-        status,
-        startDate,
-        endDate,
-        clientId
-      });
+      return await this.invoiceRepository.findByFilters({});
     }
 
killedBy: ListInvoices should call findByFilters when status is provided
statusReason: expected {} to deeply equal { status: 'PAID', …(3) }
