[Killed] BlockStatement
src/application/usecases/MarkInvoiceAsPaid.js:2:34
 export class MarkInvoiceAsPaid {
-  constructor(invoiceRepository) {
-    this.invoiceRepository = invoiceRepository;
-  }
+  constructor(invoiceRepository) {}
 
   async execute(invoiceId) {
killedBy: Invoices API E2E PATCH /api/invoices/:id/pay should mark invoice as paid
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/application/usecases/MarkInvoiceAsPaid.js:6:28
     this.invoiceRepository = invoiceRepository;
   }
 
-  async execute(invoiceId) {
-    const invoice = await this.invoiceRepository.findById(invoiceId);
-    if (!invoice) {
-      throw new Error('Invoice not found');
-    }
-
-    invoice.markAsPaid();
-    await this.invoiceRepository.save(invoice);
-
-    return invoice;
-  }
+  async execute(invoiceId) {}
 }
 
killedBy: Invoices API E2E PATCH /api/invoices/:id/pay should mark invoice as paid
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/application/usecases/MarkInvoiceAsPaid.js:8:9
 
   async execute(invoiceId) {
     const invoice = await this.invoiceRepository.findById(invoiceId);
-    if (!invoice) {
+    if (false) {
       throw new Error('Invoice not found');
     }
killedBy: Invoices API E2E PATCH /api/invoices/:id/pay should return 404 for non-existent invoice
statusReason: expected 400 to be 404 // Object.is equality

[Killed] StringLiteral
src/application/usecases/MarkInvoiceAsPaid.js:9:23
   async execute(invoiceId) {
     const invoice = await this.invoiceRepository.findById(invoiceId);
     if (!invoice) {
-      throw new Error('Invoice not found');
+      throw new Error("");
     }
 
killedBy: Invoices API E2E PATCH /api/invoices/:id/pay should return 404 for non-existent invoice
statusReason: expected 400 to be 404 // Object.is equality
