[Killed] BlockStatement
src/domain/entities/Client.js:2:45
 export class Client {
-  constructor({ id, name, email, address }) {
-    this.validate({ name, email, address });
-
-    this.id = id;
-    this.name = name;
-    this.email = email;
-    this.address = address;
-  }
+  constructor({ id, name, email, address }) {}
 
   validate({ name, email, address }) {
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected 400 to be 201 // Object.is equality

[Killed] BlockStatement
src/domain/entities/Client.js:11:38
     this.address = address;
   }
 
-  validate({ name, email, address }) {
-    if (!name || typeof name !== 'string') {
-      throw new Error('Name is required and must be a string');
-    }
-    if (!email || typeof email !== 'string' || !email.includes('@')) {
-      throw new Error('Valid email is required');
-    }
-    if (!address || typeof address !== 'string') {
-      throw new Error('Address is required and must be a string');
-    }
-  }
+  validate({ name, email, address }) {}
 
   toJSON() {
killedBy: Client constructor should throw error without name
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/domain/entities/Client.js:12:44
   }
 
   validate({ name, email, address }) {
-    if (!name || typeof name !== 'string') {
-      throw new Error('Name is required and must be a string');
-    }
+    if (!name || typeof name !== 'string') {}
     if (!email || typeof email !== 'string' || !email.includes('@')) {
       throw new Error('Valid email is required');
killedBy: Client constructor should throw error without name
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/domain/entities/Client.js:12:18
   }
 
   validate({ name, email, address }) {
-    if (!name || typeof name !== 'string') {
+    if (!name || false) {
       throw new Error('Name is required and must be a string');
     }
killedBy: Client constructor should throw error with non-string name
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/domain/entities/Client.js:15:9
     if (!name || typeof name !== 'string') {
       throw new Error('Name is required and must be a string');
     }
-    if (!email || typeof email !== 'string' || !email.includes('@')) {
+    if (email || typeof email !== 'string' || !email.includes('@')) {
       throw new Error('Valid email is required');
     }
killedBy: Client constructor should create client with valid data
statusReason: Valid email is required

[Killed] BooleanLiteral
src/domain/entities/Client.js:15:48
     if (!name || typeof name !== 'string') {
       throw new Error('Name is required and must be a string');
     }
-    if (!email || typeof email !== 'string' || !email.includes('@')) {
+    if (!email || typeof email !== 'string' || email.includes('@')) {
       throw new Error('Valid email is required');
     }
killedBy: Client constructor should create client with valid data
statusReason: Valid email is required

[Killed] ConditionalExpression
src/domain/entities/Client.js:18:9
     if (!email || typeof email !== 'string' || !email.includes('@')) {
       throw new Error('Valid email is required');
     }
-    if (!address || typeof address !== 'string') {
+    if (true) {
       throw new Error('Address is required and must be a string');
     }
killedBy: Client constructor should create client with valid data
statusReason: Address is required and must be a string

[Killed] BooleanLiteral
src/domain/entities/Client.js:18:9
     if (!email || typeof email !== 'string' || !email.includes('@')) {
       throw new Error('Valid email is required');
     }
-    if (!address || typeof address !== 'string') {
+    if (address || typeof address !== 'string') {
       throw new Error('Address is required and must be a string');
     }
killedBy: Client constructor should create client with valid data
statusReason: Address is required and must be a string

[Killed] BlockStatement
src/domain/entities/Client.js:23:12
     }
   }
 
-  toJSON() {
-    return {
-      id: this.id,
-      name: this.name,
-      email: this.email,
-      address: this.address
-    };
-  }
+  toJSON() {}
 }
 
killedBy: Client toJSON should serialize client to JSON
statusReason: expected undefined to deeply equal { id: '123', name: 'ACME Corp', …(2) }

[Killed] ObjectLiteral
src/domain/entities/Client.js:24:12
   }
 
   toJSON() {
-    return {
-      id: this.id,
-      name: this.name,
-      email: this.email,
-      address: this.address
-    };
+    return {};
   }
 }
killedBy: Client toJSON should serialize client to JSON
statusReason: expected {} to deeply equal { id: '123', name: 'ACME Corp', …(2) }
