[Killed] BlockStatement
src/domain/entities/InvoiceLine.js:2:62
 export class InvoiceLine {
-  constructor({ description, quantity, unitPrice, vatRate }) {
-    this.validate({ description, quantity, unitPrice, vatRate });
-
-    this.description = description;
-    this.quantity = quantity;
-    this.unitPrice = unitPrice;
-    this.vatRate = vatRate;
-  }
+  constructor({ description, quantity, unitPrice, vatRate }) {}
 
   validate({ description, quantity, unitPrice, vatRate }) {
killedBy: Invoice toJSON should serialize invoice to JSON
statusReason: expected { description: undefined, …(3) } to have property "description" with value 'Service de conseil'

[Killed] BlockStatement
src/domain/entities/InvoiceLine.js:11:59
     this.vatRate = vatRate;
   }
 
-  validate({ description, quantity, unitPrice, vatRate }) {
-    if (!description || typeof description !== 'string') {
-      throw new Error('Description is required and must be a string');
-    }
-    if (typeof quantity !== 'number' || quantity <= 0) {
-      throw new Error('Quantity must be a positive number');
-    }
-    if (typeof unitPrice !== 'number' || unitPrice <= 0) {
-      throw new Error('Unit price must be a positive number');
-    }
-    const validVatRates = [0, 5.5, 10, 20];
-    if (!validVatRates.includes(vatRate)) {
-      throw new Error('VAT rate must be one of: 0, 5.5, 10, 20');
-    }
-  }
+  validate({ description, quantity, unitPrice, vatRate }) {}
 
   toJSON() {
killedBy: Invoices API E2E POST /api/invoices should return 400 for invalid line data
statusReason: expected 201 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/domain/entities/InvoiceLine.js:12:9
   }
 
   validate({ description, quantity, unitPrice, vatRate }) {
-    if (!description || typeof description !== 'string') {
+    if (false) {
       throw new Error('Description is required and must be a string');
     }
killedBy: InvoiceLine constructor should throw error without description
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/domain/entities/InvoiceLine.js:12:25
   }
 
   validate({ description, quantity, unitPrice, vatRate }) {
-    if (!description || typeof description !== 'string') {
+    if (!description || typeof description === 'string') {
       throw new Error('Description is required and must be a string');
     }
killedBy: InvoiceLine constructor should create invoice line with valid data
statusReason: Description is required and must be a string

[Killed] StringLiteral
src/domain/entities/InvoiceLine.js:13:23
 
   validate({ description, quantity, unitPrice, vatRate }) {
     if (!description || typeof description !== 'string') {
-      throw new Error('Description is required and must be a string');
+      throw new Error("");
     }
     if (typeof quantity !== 'number' || quantity <= 0) {
killedBy: InvoiceLine constructor should throw error without description
statusReason: expected [Function] to throw error including 'Description is required and must be a…' but got ''

[Killed] EqualityOperator
src/domain/entities/InvoiceLine.js:15:41
     if (!description || typeof description !== 'string') {
       throw new Error('Description is required and must be a string');
     }
-    if (typeof quantity !== 'number' || quantity <= 0) {
+    if (typeof quantity !== 'number' || quantity > 0) {
       throw new Error('Quantity must be a positive number');
     }
killedBy: InvoiceLine constructor should create invoice line with valid data
statusReason: Quantity must be a positive number

[Killed] LogicalOperator
src/domain/entities/InvoiceLine.js:15:9
     if (!description || typeof description !== 'string') {
       throw new Error('Description is required and must be a string');
     }
-    if (typeof quantity !== 'number' || quantity <= 0) {
+    if (typeof quantity !== 'number' && quantity <= 0) {
       throw new Error('Quantity must be a positive number');
     }
killedBy: Invoices API E2E POST /api/invoices should return 400 for invalid line data
statusReason: expected 201 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/domain/entities/InvoiceLine.js:18:9
     if (typeof quantity !== 'number' || quantity <= 0) {
       throw new Error('Quantity must be a positive number');
     }
-    if (typeof unitPrice !== 'number' || unitPrice <= 0) {
+    if (true) {
       throw new Error('Unit price must be a positive number');
     }
killedBy: InvoiceLine constructor should create invoice line with valid data
statusReason: Unit price must be a positive number

[Killed] ConditionalExpression
src/domain/entities/InvoiceLine.js:18:42
     if (typeof quantity !== 'number' || quantity <= 0) {
       throw new Error('Quantity must be a positive number');
     }
-    if (typeof unitPrice !== 'number' || unitPrice <= 0) {
+    if (typeof unitPrice !== 'number' || false) {
       throw new Error('Unit price must be a positive number');
     }
killedBy: InvoiceLine constructor should throw error with negative unit price
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/domain/entities/InvoiceLine.js:19:23
       throw new Error('Quantity must be a positive number');
     }
     if (typeof unitPrice !== 'number' || unitPrice <= 0) {
-      throw new Error('Unit price must be a positive number');
+      throw new Error("");
     }
     const validVatRates = [0, 5.5, 10, 20];
killedBy: InvoiceLine constructor should throw error with negative unit price
statusReason: expected [Function] to throw error including 'Unit price must be a positive number' but got ''

[Killed] ConditionalExpression
src/domain/entities/InvoiceLine.js:22:9
       throw new Error('Unit price must be a positive number');
     }
     const validVatRates = [0, 5.5, 10, 20];
-    if (!validVatRates.includes(vatRate)) {
+    if (true) {
       throw new Error('VAT rate must be one of: 0, 5.5, 10, 20');
     }
killedBy: InvoiceLine constructor should create invoice line with valid data
statusReason: VAT rate must be one of: 0, 5.5, 10, 20

[Killed] BlockStatement
src/domain/entities/InvoiceLine.js:22:43
       throw new Error('Unit price must be a positive number');
     }
     const validVatRates = [0, 5.5, 10, 20];
-    if (!validVatRates.includes(vatRate)) {
-      throw new Error('VAT rate must be one of: 0, 5.5, 10, 20');
-    }
+    if (!validVatRates.includes(vatRate)) {}
   }
 
killedBy: InvoiceLine constructor should throw error with invalid VAT rate
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/domain/entities/InvoiceLine.js:23:23
     }
     const validVatRates = [0, 5.5, 10, 20];
     if (!validVatRates.includes(vatRate)) {
-      throw new Error('VAT rate must be one of: 0, 5.5, 10, 20');
+      throw new Error("");
     }
   }
killedBy: InvoiceLine constructor should throw error with invalid VAT rate
statusReason: expected [Function] to throw error including 'VAT rate must be one of: 0, 5.5, 10, …' but got ''

[Killed] BlockStatement
src/domain/entities/InvoiceLine.js:27:12
     }
   }
 
-  toJSON() {
-    return {
-      description: this.description,
-      quantity: this.quantity,
-      unitPrice: this.unitPrice,
-      vatRate: this.vatRate
-    };
-  }
+  toJSON() {}
 }
 
killedBy: InvoiceLine toJSON should serialize line to JSON
statusReason: expected undefined to deeply equal { …(4) }

[Killed] ObjectLiteral
src/domain/entities/InvoiceLine.js:28:12
   }
 
   toJSON() {
-    return {
-      description: this.description,
-      quantity: this.quantity,
-      unitPrice: this.unitPrice,
-      vatRate: this.vatRate
-    };
+    return {};
   }
 }
killedBy: InvoiceLine toJSON should serialize line to JSON
statusReason: expected {} to deeply equal { …(4) }
