[Killed] BlockStatement
src/domain/repositories/ClientRepository.js:6:22
  * Adapters must implement these methods
  */
 export class ClientRepository {
-  async save(client) {
-    throw new Error('Method save() must be implemented');
-  }
+  async save(client) {}
 
   async findById(id) {
killedBy: ClientRepository (Port) should throw error when save is not implemented
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/domain/repositories/ClientRepository.js:7:21
  */
 export class ClientRepository {
   async save(client) {
-    throw new Error('Method save() must be implemented');
+    throw new Error("");
   }
 
killedBy: ClientRepository (Port) should throw error when save is not implemented
statusReason: expected [Function] to throw error including 'Method save() must be implemented' but got ''

[Killed] BlockStatement
src/domain/repositories/ClientRepository.js:10:22
     throw new Error('Method save() must be implemented');
   }
 
-  async findById(id) {
-    throw new Error('Method findById() must be implemented');
-  }
+  async findById(id) {}
 
   async findAll() {
killedBy: ClientRepository (Port) should throw error when findById is not implemented
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/domain/repositories/ClientRepository.js:14:19
     throw new Error('Method findById() must be implemented');
   }
 
-  async findAll() {
-    throw new Error('Method findAll() must be implemented');
-  }
+  async findAll() {}
 }
 
killedBy: ClientRepository (Port) should throw error when findAll is not implemented
statusReason: promise resolved "undefined" instead of rejecting
