[Killed] BlockStatement
src/domain/repositories/InvoiceRepository.js:6:23
  * Adapters must implement these methods
  */
 export class InvoiceRepository {
-  async save(invoice) {
-    throw new Error('Method save() must be implemented');
-  }
+  async save(invoice) {}
 
   async findById(id) {
killedBy: InvoiceRepository (Port) should throw error when save is not implemented
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/domain/repositories/InvoiceRepository.js:7:21
  */
 export class InvoiceRepository {
   async save(invoice) {
-    throw new Error('Method save() must be implemented');
+    throw new Error("");
   }
 
killedBy: InvoiceRepository (Port) should throw error when save is not implemented
statusReason: expected [Function] to throw error including 'Method save() must be implemented' but got ''

[Killed] StringLiteral
src/domain/repositories/InvoiceRepository.js:15:21
   }
 
   async findAll() {
-    throw new Error('Method findAll() must be implemented');
+    throw new Error("");
   }
 
killedBy: InvoiceRepository (Port) should throw error when findAll is not implemented
statusReason: expected [Function] to throw error including 'Method findAll() must be implemented' but got ''

[Killed] BlockStatement
src/domain/repositories/InvoiceRepository.js:18:65
     throw new Error('Method findAll() must be implemented');
   }
 
-  async findByFilters({ status, startDate, endDate, clientId }) {
-    throw new Error('Method findByFilters() must be implemented');
-  }
+  async findByFilters({ status, startDate, endDate, clientId }) {}
 
   async getNextInvoiceNumber(year) {
killedBy: InvoiceRepository (Port) should throw error when findByFilters is not implemented
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/domain/repositories/InvoiceRepository.js:22:36
     throw new Error('Method findByFilters() must be implemented');
   }
 
-  async getNextInvoiceNumber(year) {
-    throw new Error('Method getNextInvoiceNumber() must be implemented');
-  }
+  async getNextInvoiceNumber(year) {}
 }
 
killedBy: InvoiceRepository (Port) should throw error when getNextInvoiceNumber is not implemented
statusReason: promise resolved "undefined" instead of rejecting
