[Killed] BlockStatement
src/domain/services/InvoiceCalculator.js:5:28
   /**
    * Calculate the total amount excluding tax for an invoice line
    */
-  calculateLineTotal(line) {
-    return Math.round(line.quantity * line.unitPrice * 100) / 100;
-  }
+  calculateLineTotal(line) {}
 
   /**
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/domain/services/InvoiceCalculator.js:6:12
    * Calculate the total amount excluding tax for an invoice line
    */
   calculateLineTotal(line) {
-    return Math.round(line.quantity * line.unitPrice * 100) / 100;
+    return Math.round(line.quantity * line.unitPrice * 100) * 100;
   }
 
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/domain/services/InvoiceCalculator.js:6:23
    * Calculate the total amount excluding tax for an invoice line
    */
   calculateLineTotal(line) {
-    return Math.round(line.quantity * line.unitPrice * 100) / 100;
+    return Math.round(line.quantity / line.unitPrice * 100) / 100;
   }
 
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] BlockStatement
src/domain/services/InvoiceCalculator.js:12:26
   /**
    * Calculate the VAT amount for an invoice line
    */
-  calculateLineVat(line) {
-    const total = this.calculateLineTotal(line);
-    return Math.round(total * (line.vatRate / 100) * 100) / 100;
-  }
+  calculateLineVat(line) {}
 
   /**
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/domain/services/InvoiceCalculator.js:14:12
    */
   calculateLineVat(line) {
     const total = this.calculateLineTotal(line);
-    return Math.round(total * (line.vatRate / 100) * 100) / 100;
+    return Math.round(total * (line.vatRate / 100) * 100) * 100;
   }
 
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/domain/services/InvoiceCalculator.js:14:23
    */
   calculateLineVat(line) {
     const total = this.calculateLineTotal(line);
-    return Math.round(total * (line.vatRate / 100) * 100) / 100;
+    return Math.round(total * (line.vatRate / 100) / 100) / 100;
   }
 
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] BlockStatement
src/domain/services/InvoiceCalculator.js:20:35
   /**
    * Calculate invoice totals (excluding tax, VAT, including tax)
    */
-  calculateInvoiceTotals(invoice) {
-    let totalExcludingTax = 0;
-    let totalVat = 0;
-
-    for (const line of invoice.lines) {
-      totalExcludingTax += this.calculateLineTotal(line);
-      totalVat += this.calculateLineVat(line);
-    }
-
-    // Round to 2 decimals
-    totalExcludingTax = Math.round(totalExcludingTax * 100) / 100;
-    totalVat = Math.round(totalVat * 100) / 100;
-    const totalIncludingTax = Math.round((totalExcludingTax + totalVat) * 100) / 100;
-
-    return {
-      totalExcludingTax,
-      totalVat,
-      totalIncludingTax
-    };
-  }
+  calculateInvoiceTotals(invoice) {}
 }
 
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected 400 to be 201 // Object.is equality

[Killed] BlockStatement
src/domain/services/InvoiceCalculator.js:24:39
     let totalExcludingTax = 0;
     let totalVat = 0;
 
-    for (const line of invoice.lines) {
-      totalExcludingTax += this.calculateLineTotal(line);
-      totalVat += this.calculateLineVat(line);
-    }
+    for (const line of invoice.lines) {}
 
     // Round to 2 decimals
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] AssignmentOperator
src/domain/services/InvoiceCalculator.js:25:7
     let totalVat = 0;
 
     for (const line of invoice.lines) {
-      totalExcludingTax += this.calculateLineTotal(line);
+      totalExcludingTax -= this.calculateLineTotal(line);
       totalVat += this.calculateLineVat(line);
     }
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] AssignmentOperator
src/domain/services/InvoiceCalculator.js:26:7
 
     for (const line of invoice.lines) {
       totalExcludingTax += this.calculateLineTotal(line);
-      totalVat += this.calculateLineVat(line);
+      totalVat -= this.calculateLineVat(line);
     }
 
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/domain/services/InvoiceCalculator.js:30:36
     }
 
     // Round to 2 decimals
-    totalExcludingTax = Math.round(totalExcludingTax * 100) / 100;
+    totalExcludingTax = Math.round(totalExcludingTax / 100) / 100;
     totalVat = Math.round(totalVat * 100) / 100;
     const totalIncludingTax = Math.round((totalExcludingTax + totalVat) * 100) / 100;
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/domain/services/InvoiceCalculator.js:30:25
     }
 
     // Round to 2 decimals
-    totalExcludingTax = Math.round(totalExcludingTax * 100) / 100;
+    totalExcludingTax = Math.round(totalExcludingTax * 100) * 100;
     totalVat = Math.round(totalVat * 100) / 100;
     const totalIncludingTax = Math.round((totalExcludingTax + totalVat) * 100) / 100;
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/domain/services/InvoiceCalculator.js:31:27
 
     // Round to 2 decimals
     totalExcludingTax = Math.round(totalExcludingTax * 100) / 100;
-    totalVat = Math.round(totalVat * 100) / 100;
+    totalVat = Math.round(totalVat / 100) / 100;
     const totalIncludingTax = Math.round((totalExcludingTax + totalVat) * 100) / 100;
 
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/domain/services/InvoiceCalculator.js:31:16
 
     // Round to 2 decimals
     totalExcludingTax = Math.round(totalExcludingTax * 100) / 100;
-    totalVat = Math.round(totalVat * 100) / 100;
+    totalVat = Math.round(totalVat * 100) * 100;
     const totalIncludingTax = Math.round((totalExcludingTax + totalVat) * 100) / 100;
 
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/domain/services/InvoiceCalculator.js:32:31
     // Round to 2 decimals
     totalExcludingTax = Math.round(totalExcludingTax * 100) / 100;
     totalVat = Math.round(totalVat * 100) / 100;
-    const totalIncludingTax = Math.round((totalExcludingTax + totalVat) * 100) / 100;
+    const totalIncludingTax = Math.round((totalExcludingTax + totalVat) * 100) * 100;
 
     return {
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/domain/services/InvoiceCalculator.js:32:42
     // Round to 2 decimals
     totalExcludingTax = Math.round(totalExcludingTax * 100) / 100;
     totalVat = Math.round(totalVat * 100) / 100;
-    const totalIncludingTax = Math.round((totalExcludingTax + totalVat) * 100) / 100;
+    const totalIncludingTax = Math.round((totalExcludingTax + totalVat) / 100) / 100;
 
     return {
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected { id: 'invoice-1', …(8) } to match object { number: 'INV-2025-001', …(5) }
(3 matching properties omitted from actual)
