[Killed] BlockStatement
src/domain/valueObjects/Money.js:2:41
 export class Money {
-  constructor(amount, currency = 'EUR') {
-    if (typeof amount !== 'number' || amount < 0) {
-      throw new Error('Amount must be a positive number');
-    }
-    if (typeof currency !== 'string' || currency.length !== 3) {
-      throw new Error('Currency must be a 3-letter code');
-    }
-    this.amount = Math.round(amount * 100) / 100; // Round to 2 decimals
-    this.currency = currency;
-  }
+  constructor(amount, currency = 'EUR') {}
 
   add(other) {
killedBy: Money constructor should create money with valid amount and currency
statusReason: expected undefined to be 100 // Object.is equality

[Killed] StringLiteral
src/domain/valueObjects/Money.js:2:34
 export class Money {
-  constructor(amount, currency = 'EUR') {
+  constructor(amount, currency = "") {
     if (typeof amount !== 'number' || amount < 0) {
       throw new Error('Amount must be a positive number');
killedBy: Money constructor should default to EUR currency
statusReason: Currency must be a 3-letter code

[Killed] ConditionalExpression
src/domain/valueObjects/Money.js:3:9
 export class Money {
   constructor(amount, currency = 'EUR') {
-    if (typeof amount !== 'number' || amount < 0) {
+    if (false) {
       throw new Error('Amount must be a positive number');
     }
killedBy: Money constructor should throw error for negative amount
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/domain/valueObjects/Money.js:3:9
 export class Money {
   constructor(amount, currency = 'EUR') {
-    if (typeof amount !== 'number' || amount < 0) {
+    if (false || amount < 0) {
       throw new Error('Amount must be a positive number');
     }
killedBy: Money constructor should throw error for non-number amount
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/domain/valueObjects/Money.js:6:64
     if (typeof amount !== 'number' || amount < 0) {
       throw new Error('Amount must be a positive number');
     }
-    if (typeof currency !== 'string' || currency.length !== 3) {
-      throw new Error('Currency must be a 3-letter code');
-    }
+    if (typeof currency !== 'string' || currency.length !== 3) {}
     this.amount = Math.round(amount * 100) / 100; // Round to 2 decimals
     this.currency = currency;
killedBy: Money constructor should throw error for invalid currency
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/domain/valueObjects/Money.js:6:9
     if (typeof amount !== 'number' || amount < 0) {
       throw new Error('Amount must be a positive number');
     }
-    if (typeof currency !== 'string' || currency.length !== 3) {
+    if (false) {
       throw new Error('Currency must be a 3-letter code');
     }
killedBy: Money constructor should throw error for invalid currency
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/domain/valueObjects/Money.js:7:23
       throw new Error('Amount must be a positive number');
     }
     if (typeof currency !== 'string' || currency.length !== 3) {
-      throw new Error('Currency must be a 3-letter code');
+      throw new Error("");
     }
     this.amount = Math.round(amount * 100) / 100; // Round to 2 decimals
killedBy: Money constructor should throw error for invalid currency
statusReason: expected [Function] to throw error including 'Currency must be a 3-letter code' but got ''

[Killed] ArithmeticOperator
src/domain/valueObjects/Money.js:9:30
     if (typeof currency !== 'string' || currency.length !== 3) {
       throw new Error('Currency must be a 3-letter code');
     }
-    this.amount = Math.round(amount * 100) / 100; // Round to 2 decimals
+    this.amount = Math.round(amount / 100) / 100; // Round to 2 decimals
     this.currency = currency;
   }
killedBy: Money constructor should create money with valid amount and currency
statusReason: expected 0.01 to be 100 // Object.is equality

[Killed] ArithmeticOperator
src/domain/valueObjects/Money.js:9:19
     if (typeof currency !== 'string' || currency.length !== 3) {
       throw new Error('Currency must be a 3-letter code');
     }
-    this.amount = Math.round(amount * 100) / 100; // Round to 2 decimals
+    this.amount = Math.round(amount * 100) * 100; // Round to 2 decimals
     this.currency = currency;
   }
killedBy: Money constructor should create money with valid amount and currency
statusReason: expected 1000000 to be 100 // Object.is equality

[Killed] BlockStatement
src/domain/valueObjects/Money.js:13:14
     this.currency = currency;
   }
 
-  add(other) {
-    if (this.currency !== other.currency) {
-      throw new Error('Cannot add money with different currencies');
-    }
-    return new Money(this.amount + other.amount, this.currency);
-  }
+  add(other) {}
 
   multiply(factor) {
killedBy: Money add should add money with same currency
statusReason: Cannot read properties of undefined (reading 'amount')

[Killed] EqualityOperator
src/domain/valueObjects/Money.js:14:9
   }
 
   add(other) {
-    if (this.currency !== other.currency) {
+    if (this.currency === other.currency) {
       throw new Error('Cannot add money with different currencies');
     }
killedBy: Money add should add money with same currency
statusReason: Cannot add money with different currencies

[Killed] ConditionalExpression
src/domain/valueObjects/Money.js:14:9
   }
 
   add(other) {
-    if (this.currency !== other.currency) {
+    if (true) {
       throw new Error('Cannot add money with different currencies');
     }
killedBy: Money add should add money with same currency
statusReason: Cannot add money with different currencies

[Killed] ArithmeticOperator
src/domain/valueObjects/Money.js:17:22
     if (this.currency !== other.currency) {
       throw new Error('Cannot add money with different currencies');
     }
-    return new Money(this.amount + other.amount, this.currency);
+    return new Money(this.amount - other.amount, this.currency);
   }
 
killedBy: Money add should add money with same currency
statusReason: expected 50 to be 150 // Object.is equality

[Killed] BlockStatement
src/domain/valueObjects/Money.js:20:20
     return new Money(this.amount + other.amount, this.currency);
   }
 
-  multiply(factor) {
-    if (typeof factor !== 'number' || factor < 0) {
-      throw new Error('Factor must be a positive number');
-    }
-    return new Money(this.amount * factor, this.currency);
-  }
+  multiply(factor) {}
 
   equals(other) {
killedBy: Money multiply should multiply money by factor
statusReason: Cannot read properties of undefined (reading 'amount')

[Killed] EqualityOperator
src/domain/valueObjects/Money.js:21:9
   }
 
   multiply(factor) {
-    if (typeof factor !== 'number' || factor < 0) {
+    if (typeof factor === 'number' || factor < 0) {
       throw new Error('Factor must be a positive number');
     }
killedBy: Money multiply should multiply money by factor
statusReason: Factor must be a positive number

[Killed] EqualityOperator
src/domain/valueObjects/Money.js:21:39
   }
 
   multiply(factor) {
-    if (typeof factor !== 'number' || factor < 0) {
+    if (typeof factor !== 'number' || factor <= 0) {
       throw new Error('Factor must be a positive number');
     }
killedBy: Money multiply should multiply by zero
statusReason: Factor must be a positive number

[Killed] ArithmeticOperator
src/domain/valueObjects/Money.js:24:22
     if (typeof factor !== 'number' || factor < 0) {
       throw new Error('Factor must be a positive number');
     }
-    return new Money(this.amount * factor, this.currency);
+    return new Money(this.amount / factor, this.currency);
   }
 
killedBy: Money multiply should multiply money by factor
statusReason: expected 3.33 to be 30 // Object.is equality

[Killed] BlockStatement
src/domain/valueObjects/Money.js:27:17
     return new Money(this.amount * factor, this.currency);
   }
 
-  equals(other) {
-    return this.amount === other.amount && this.currency === other.currency;
-  }
+  equals(other) {}
 
   toJSON() {
killedBy: Money equals should return true for equal money
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/domain/valueObjects/Money.js:28:44
   }
 
   equals(other) {
-    return this.amount === other.amount && this.currency === other.currency;
+    return this.amount === other.amount && true;
   }
 
killedBy: Money equals should return false for different currencies
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/domain/valueObjects/Money.js:28:12
   }
 
   equals(other) {
-    return this.amount === other.amount && this.currency === other.currency;
+    return this.amount === other.amount || this.currency === other.currency;
   }
 
killedBy: Money equals should return false for different amounts
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/domain/valueObjects/Money.js:31:12
     return this.amount === other.amount && this.currency === other.currency;
   }
 
-  toJSON() {
-    return {
-      amount: this.amount,
-      currency: this.currency
-    };
-  }
+  toJSON() {}
 }
 
killedBy: Money toJSON should serialize to JSON
statusReason: expected undefined to deeply equal { amount: 100, currency: 'EUR' }
