[Killed] BlockStatement
src/infrastructure/container.js:13:17
  * Simple container for dependency injection
  */
 export class Container {
-  constructor() {
-    // Repositories (singletons)
-    this.invoiceRepository = new InMemoryInvoiceRepository();
-    this.clientRepository = new InMemoryClientRepository();
-  }
+  constructor() {}
 
   // Use cases
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: Cannot read properties of undefined (reading 'save')

[Killed] BlockStatement
src/infrastructure/container.js:20:29
   }
 
   // Use cases
-  getCreateInvoiceUseCase() {
-    return new CreateInvoice(this.invoiceRepository, this.clientRepository);
-  }
+  getCreateInvoiceUseCase() {}
 
   getGetInvoiceUseCase() {
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected 400 to be 201 // Object.is equality

[Killed] BlockStatement
src/infrastructure/container.js:24:26
     return new CreateInvoice(this.invoiceRepository, this.clientRepository);
   }
 
-  getGetInvoiceUseCase() {
-    return new GetInvoice(this.invoiceRepository);
-  }
+  getGetInvoiceUseCase() {}
 
   getListInvoicesUseCase() {
killedBy: Invoices API E2E GET /api/invoices/:id should retrieve an invoice by id
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/infrastructure/container.js:28:28
     return new GetInvoice(this.invoiceRepository);
   }
 
-  getListInvoicesUseCase() {
-    return new ListInvoices(this.invoiceRepository);
-  }
+  getListInvoicesUseCase() {}
 
   getMarkInvoiceAsPaidUseCase() {
killedBy: Invoices API E2E GET /api/invoices should list all invoices
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/infrastructure/container.js:32:33
     return new ListInvoices(this.invoiceRepository);
   }
 
-  getMarkInvoiceAsPaidUseCase() {
-    return new MarkInvoiceAsPaid(this.invoiceRepository);
-  }
+  getMarkInvoiceAsPaidUseCase() {}
 
   getGetRevenueUseCase() {
killedBy: Invoices API E2E PATCH /api/invoices/:id/pay should mark invoice as paid
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/infrastructure/container.js:36:26
     return new MarkInvoiceAsPaid(this.invoiceRepository);
   }
 
-  getGetRevenueUseCase() {
-    return new GetRevenue(this.invoiceRepository);
-  }
+  getGetRevenueUseCase() {}
 
   // Repositories (for direct access if needed)
killedBy: Invoices API E2E GET /api/invoices/revenue should calculate revenue for period
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/infrastructure/container.js:41:26
   }
 
   // Repositories (for direct access if needed)
-  getInvoiceRepository() {
-    return this.invoiceRepository;
-  }
+  getInvoiceRepository() {}
 
   getClientRepository() {
killedBy: Container should return invoice repository
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/infrastructure/container.js:45:25
     return this.invoiceRepository;
   }
 
-  getClientRepository() {
-    return this.clientRepository;
-  }
+  getClientRepository() {}
 }
 
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: Cannot read properties of undefined (reading 'save')
