[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:2:26
 export class InvoiceController {
-  constructor(container) {
-    this.container = container;
-  }
+  constructor(container) {}
 
   async createInvoice(req, res) {
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected 400 to be 201 // Object.is equality

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:6:33
     this.container = container;
   }
 
-  async createInvoice(req, res) {
-    try {
-      const { clientId, lines } = req.body;
-
-      if (!clientId || !lines || !Array.isArray(lines)) {
-        return res.status(400).json({ error: 'clientId and lines are required' });
-      }
-
-      const useCase = this.container.getCreateInvoiceUseCase();
-      const invoice = await useCase.execute({ clientId, lines });
-
-      res.status(201).json(invoice.toJSON());
-    } catch (error) {
-      res.status(400).json({ error: error.message });
-    }
-  }
+  async createInvoice(req, res) {}
 
   async getInvoice(req, res) {
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:7:9
   }
 
   async createInvoice(req, res) {
-    try {
-      const { clientId, lines } = req.body;
-
-      if (!clientId || !lines || !Array.isArray(lines)) {
-        return res.status(400).json({ error: 'clientId and lines are required' });
-      }
-
-      const useCase = this.container.getCreateInvoiceUseCase();
-      const invoice = await useCase.execute({ clientId, lines });
-
-      res.status(201).json(invoice.toJSON());
-    } catch (error) {
+    try {} catch (error) {
       res.status(400).json({ error: error.message });
     }
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
infrastructure/http/controllers/InvoiceController.js:10:11
     try {
       const { clientId, lines } = req.body;
 
-      if (!clientId || !lines || !Array.isArray(lines)) {
+      if ((!clientId || !lines) && !Array.isArray(lines)) {
         return res.status(400).json({ error: 'clientId and lines are required' });
       }
killedBy: InvoiceController createInvoice should return 400 when clientId is missing
statusReason: expected 201 to be 400 // Object.is equality

[Killed] ConditionalExpression
infrastructure/http/controllers/InvoiceController.js:10:11
     try {
       const { clientId, lines } = req.body;
 
-      if (!clientId || !lines || !Array.isArray(lines)) {
+      if (false) {
         return res.status(400).json({ error: 'clientId and lines are required' });
       }
killedBy: InvoiceController createInvoice should return 400 when clientId is missing
statusReason: expected 201 to be 400 // Object.is equality

[Killed] StringLiteral
infrastructure/http/controllers/InvoiceController.js:11:46
       const { clientId, lines } = req.body;
 
       if (!clientId || !lines || !Array.isArray(lines)) {
-        return res.status(400).json({ error: 'clientId and lines are required' });
+        return res.status(400).json({ error: "" });
       }
 
killedBy: InvoiceController createInvoice should return 400 when clientId is missing
statusReason: expected '' to be 'clientId and lines are required' // Object.is equality

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:18:21
       const invoice = await useCase.execute({ clientId, lines });
 
       res.status(201).json(invoice.toJSON());
-    } catch (error) {
-      res.status(400).json({ error: error.message });
-    }
+    } catch (error) {}
   }
 
killedBy: InvoiceController createInvoice should handle use case errors
statusReason: expected undefined to be 400 // Object.is equality

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:23:30
     }
   }
 
-  async getInvoice(req, res) {
-    try {
-      const { id } = req.params;
-
-      const useCase = this.container.getGetInvoiceUseCase();
-      const invoice = await useCase.execute(id);
-
-      res.json(invoice.toJSON());
-    } catch (error) {
-      if (error.message === 'Invoice not found') {
-        return res.status(404).json({ error: error.message });
-      }
-      res.status(400).json({ error: error.message });
-    }
-  }
+  async getInvoice(req, res) {}
 
   async listInvoices(req, res) {
killedBy: InvoiceController getInvoice should return 404 when invoice not found
statusReason: expected undefined to be 404 // Object.is equality

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:24:9
   }
 
   async getInvoice(req, res) {
-    try {
-      const { id } = req.params;
-
-      const useCase = this.container.getGetInvoiceUseCase();
-      const invoice = await useCase.execute(id);
-
-      res.json(invoice.toJSON());
-    } catch (error) {
+    try {} catch (error) {
       if (error.message === 'Invoice not found') {
         return res.status(404).json({ error: error.message });
killedBy: InvoiceController getInvoice should return 404 when invoice not found
statusReason: expected undefined to be 404 // Object.is equality

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:31:21
       const invoice = await useCase.execute(id);
 
       res.json(invoice.toJSON());
-    } catch (error) {
-      if (error.message === 'Invoice not found') {
-        return res.status(404).json({ error: error.message });
-      }
-      res.status(400).json({ error: error.message });
-    }
+    } catch (error) {}
   }
 
killedBy: InvoiceController getInvoice should return 404 when invoice not found
statusReason: expected undefined to be 404 // Object.is equality

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:32:50
 
       res.json(invoice.toJSON());
     } catch (error) {
-      if (error.message === 'Invoice not found') {
-        return res.status(404).json({ error: error.message });
-      }
+      if (error.message === 'Invoice not found') {}
       res.status(400).json({ error: error.message });
     }
killedBy: InvoiceController getInvoice should return 404 when invoice not found
statusReason: expected 400 to be 404 // Object.is equality

[Killed] ConditionalExpression
infrastructure/http/controllers/InvoiceController.js:32:11
 
       res.json(invoice.toJSON());
     } catch (error) {
-      if (error.message === 'Invoice not found') {
+      if (true) {
         return res.status(404).json({ error: error.message });
       }
killedBy: InvoiceController getInvoice should return 400 for other errors
statusReason: expected 404 to be 400 // Object.is equality

[Killed] ObjectLiteral
infrastructure/http/controllers/InvoiceController.js:33:37
       res.json(invoice.toJSON());
     } catch (error) {
       if (error.message === 'Invoice not found') {
-        return res.status(404).json({ error: error.message });
+        return res.status(404).json({});
       }
       res.status(400).json({ error: error.message });
killedBy: InvoiceController getInvoice should return 404 when invoice not found
statusReason: expected undefined to be 'Invoice not found' // Object.is equality

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:39:32
     }
   }
 
-  async listInvoices(req, res) {
-    try {
-      const { status, startDate, endDate, clientId } = req.query;
-
-      const useCase = this.container.getListInvoicesUseCase();
-      const invoices = await useCase.execute({ status, startDate, endDate, clientId });
-
-      res.json(invoices.map(inv => inv.toJSON()));
-    } catch (error) {
-      res.status(400).json({ error: error.message });
-    }
-  }
+  async listInvoices(req, res) {}
 
   async markInvoiceAsPaid(req, res) {
killedBy: InvoiceController listInvoices should pass all filters to use case
statusReason: expected null to deeply equal { status: 'PAID', …(3) }

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:40:9
   }
 
   async listInvoices(req, res) {
-    try {
-      const { status, startDate, endDate, clientId } = req.query;
-
-      const useCase = this.container.getListInvoicesUseCase();
-      const invoices = await useCase.execute({ status, startDate, endDate, clientId });
-
-      res.json(invoices.map(inv => inv.toJSON()));
-    } catch (error) {
+    try {} catch (error) {
       res.status(400).json({ error: error.message });
     }
killedBy: InvoiceController listInvoices should pass all filters to use case
statusReason: expected null to deeply equal { status: 'PAID', …(3) }

[Killed] ArrowFunction
infrastructure/http/controllers/InvoiceController.js:46:29
       const useCase = this.container.getListInvoicesUseCase();
       const invoices = await useCase.execute({ status, startDate, endDate, clientId });
 
-      res.json(invoices.map(inv => inv.toJSON()));
+      res.json(invoices.map(() => undefined));
     } catch (error) {
       res.status(400).json({ error: error.message });
killedBy: Invoices API E2E GET /api/invoices should filter invoices by status
statusReason: Cannot read properties of null (reading 'status')

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:47:21
       const invoices = await useCase.execute({ status, startDate, endDate, clientId });
 
       res.json(invoices.map(inv => inv.toJSON()));
-    } catch (error) {
-      res.status(400).json({ error: error.message });
-    }
+    } catch (error) {}
   }
 
killedBy: InvoiceController listInvoices should handle errors
statusReason: expected undefined to be 400 // Object.is equality

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:52:37
     }
   }
 
-  async markInvoiceAsPaid(req, res) {
-    try {
-      const { id } = req.params;
-
-      const useCase = this.container.getMarkInvoiceAsPaidUseCase();
-      const invoice = await useCase.execute(id);
-
-      res.json(invoice.toJSON());
-    } catch (error) {
-      if (error.message === 'Invoice not found') {
-        return res.status(404).json({ error: error.message });
-      }
-      res.status(400).json({ error: error.message });
-    }
-  }
+  async markInvoiceAsPaid(req, res) {}
 
   async getRevenue(req, res) {
killedBy: InvoiceController markInvoiceAsPaid should return 404 when invoice not found
statusReason: expected undefined to be 404 // Object.is equality

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:53:9
   }
 
   async markInvoiceAsPaid(req, res) {
-    try {
-      const { id } = req.params;
-
-      const useCase = this.container.getMarkInvoiceAsPaidUseCase();
-      const invoice = await useCase.execute(id);
-
-      res.json(invoice.toJSON());
-    } catch (error) {
+    try {} catch (error) {
       if (error.message === 'Invoice not found') {
         return res.status(404).json({ error: error.message });
killedBy: InvoiceController markInvoiceAsPaid should return 404 when invoice not found
statusReason: expected undefined to be 404 // Object.is equality

[Killed] ObjectLiteral
infrastructure/http/controllers/InvoiceController.js:64:28
       if (error.message === 'Invoice not found') {
         return res.status(404).json({ error: error.message });
       }
-      res.status(400).json({ error: error.message });
+      res.status(400).json({});
     }
   }
killedBy: InvoiceController markInvoiceAsPaid should return 400 for other errors
statusReason: expected undefined to be 'Already paid' // Object.is equality

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:68:30
     }
   }
 
-  async getRevenue(req, res) {
-    try {
-      const { startDate, endDate } = req.query;
-
-      if (!startDate || !endDate) {
-        return res.status(400).json({ error: 'startDate and endDate are required' });
-      }
-
-      const useCase = this.container.getGetRevenueUseCase();
-      const revenue = await useCase.execute({ startDate, endDate });
-
-      res.json(revenue);
-    } catch (error) {
-      res.status(400).json({ error: error.message });
-    }
-  }
+  async getRevenue(req, res) {}
 }
 
killedBy: InvoiceController getRevenue should return 400 when startDate is missing
statusReason: expected undefined to be 400 // Object.is equality

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:69:9
   }
 
   async getRevenue(req, res) {
-    try {
-      const { startDate, endDate } = req.query;
-
-      if (!startDate || !endDate) {
-        return res.status(400).json({ error: 'startDate and endDate are required' });
-      }
-
-      const useCase = this.container.getGetRevenueUseCase();
-      const revenue = await useCase.execute({ startDate, endDate });
-
-      res.json(revenue);
-    } catch (error) {
+    try {} catch (error) {
       res.status(400).json({ error: error.message });
     }
killedBy: InvoiceController getRevenue should return 400 when startDate is missing
statusReason: expected undefined to be 400 // Object.is equality

[Killed] BooleanLiteral
infrastructure/http/controllers/InvoiceController.js:72:11
     try {
       const { startDate, endDate } = req.query;
 
-      if (!startDate || !endDate) {
+      if (startDate || !endDate) {
         return res.status(400).json({ error: 'startDate and endDate are required' });
       }
killedBy: InvoiceController getRevenue should return 400 when startDate is missing
statusReason: expected undefined to be 400 // Object.is equality

[Killed] LogicalOperator
infrastructure/http/controllers/InvoiceController.js:72:11
     try {
       const { startDate, endDate } = req.query;
 
-      if (!startDate || !endDate) {
+      if (!startDate && !endDate) {
         return res.status(400).json({ error: 'startDate and endDate are required' });
       }
killedBy: InvoiceController getRevenue should return 400 when startDate is missing
statusReason: expected undefined to be 400 // Object.is equality

[Killed] BlockStatement
infrastructure/http/controllers/InvoiceController.js:80:21
       const revenue = await useCase.execute({ startDate, endDate });
 
       res.json(revenue);
-    } catch (error) {
-      res.status(400).json({ error: error.message });
-    }
+    } catch (error) {}
   }
 }
killedBy: InvoiceController getRevenue should handle use case errors
statusReason: expected undefined to be 400 // Object.is equality
