[Killed] ArrowFunction
infrastructure/http/routes/invoiceRoutes.js:32:28
    *             schema:
    *               $ref: '#/components/schemas/Error'
    */
-  router.post('/invoices', (req, res) => controller.createInvoice(req, res));
+  router.post('/invoices', () => undefined);
 
   /**
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
infrastructure/http/routes/invoiceRoutes.js:32:15
    *             schema:
    *               $ref: '#/components/schemas/Error'
    */
-  router.post('/invoices', (req, res) => controller.createInvoice(req, res));
+  router.post("", (req, res) => controller.createInvoice(req, res));
 
   /**
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected 404 to be 201 // Object.is equality

[Killed] ArrowFunction
infrastructure/http/routes/invoiceRoutes.js:75:27
    *               items:
    *                 $ref: '#/components/schemas/Invoice'
    */
-  router.get('/invoices', (req, res) => controller.listInvoices(req, res));
+  router.get('/invoices', () => undefined);
 
   /**
killedBy: Invoices API E2E GET /api/invoices should list all invoices
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
infrastructure/http/routes/invoiceRoutes.js:75:14
    *               items:
    *                 $ref: '#/components/schemas/Invoice'
    */
-  router.get('/invoices', (req, res) => controller.listInvoices(req, res));
+  router.get("", (req, res) => controller.listInvoices(req, res));
 
   /**
killedBy: Invoices API E2E GET /api/invoices should list all invoices
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ArrowFunction
infrastructure/http/routes/invoiceRoutes.js:114:35
    *             schema:
    *               $ref: '#/components/schemas/Error'
    */
-  router.get('/invoices/revenue', (req, res) => controller.getRevenue(req, res));
+  router.get('/invoices/revenue', () => undefined);
 
   /**
killedBy: Invoices API E2E GET /api/invoices/revenue should calculate revenue for period
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
infrastructure/http/routes/invoiceRoutes.js:144:31
    *             schema:
    *               $ref: '#/components/schemas/Error'
    */
-  router.get('/invoices/:id', (req, res) => controller.getInvoice(req, res));
+  router.get('/invoices/:id', () => undefined);
 
   /**
killedBy: Invoices API E2E GET /api/invoices/:id should retrieve an invoice by id
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
infrastructure/http/routes/invoiceRoutes.js:180:37
    *             schema:
    *               $ref: '#/components/schemas/Error'
    */
-  router.patch('/invoices/:id/pay', (req, res) => controller.markInvoiceAsPaid(req, res));
+  router.patch('/invoices/:id/pay', () => undefined);
 
   return router;
killedBy: Invoices API E2E PATCH /api/invoices/:id/pay should mark invoice as paid
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
infrastructure/http/routes/invoiceRoutes.js:180:16
    *             schema:
    *               $ref: '#/components/schemas/Error'
    */
-  router.patch('/invoices/:id/pay', (req, res) => controller.markInvoiceAsPaid(req, res));
+  router.patch("", (req, res) => controller.markInvoiceAsPaid(req, res));
 
   return router;
killedBy: Invoices API E2E PATCH /api/invoices/:id/pay should mark invoice as paid
statusReason: expected 404 to be 200 // Object.is equality
