[Killed] BlockStatement
src/infrastructure/repositories/InMemoryClientRepository.js:4:17
 import { ClientRepository } from '../../domain/repositories/ClientRepository.js';
 
 export class InMemoryClientRepository extends ClientRepository {
-  constructor() {
-    super();
-    this.clients = new Map();
-  }
+  constructor() {}
 
   async save(client) {
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryClientRepository.js:9:22
     this.clients = new Map();
   }
 
-  async save(client) {
-    this.clients.set(client.id, client);
-    return client;
-  }
+  async save(client) {}
 
   async findById(id) {
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected 400 to be 201 // Object.is equality

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryClientRepository.js:14:22
     return client;
   }
 
-  async findById(id) {
-    return this.clients.get(id) || null;
-  }
+  async findById(id) {}
 
   async findAll() {
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected 400 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/repositories/InMemoryClientRepository.js:15:12
   }
 
   async findById(id) {
-    return this.clients.get(id) || null;
+    return true;
   }
 
killedBy: Invoices API E2E POST /api/invoices should return 400 for invalid client
statusReason: expected 201 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/repositories/InMemoryClientRepository.js:15:12
   }
 
   async findById(id) {
-    return this.clients.get(id) || null;
+    return false;
   }
 
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: expected 400 to be 201 // Object.is equality

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryClientRepository.js:18:19
     return this.clients.get(id) || null;
   }
 
-  async findAll() {
-    return Array.from(this.clients.values());
-  }
+  async findAll() {}
 
   // Useful method for tests
killedBy: InMemoryClientRepository should find all clients
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryClientRepository.js:23:11
   }
 
   // Useful method for tests
-  clear() {
-    this.clients.clear();
-  }
+  clear() {}
 }
 
killedBy: InMemoryClientRepository should clear all clients
statusReason: expected Client{ id: '1', …(3) } to be null
