[Killed] BlockStatement
src/infrastructure/repositories/InMemoryInvoiceRepository.js:4:17
 import { InvoiceRepository } from '../../domain/repositories/InvoiceRepository.js';
 
 export class InMemoryInvoiceRepository extends InvoiceRepository {
-  constructor() {
-    super();
-    this.invoices = new Map();
-    this.invoiceCounters = new Map(); // To generate invoice numbers
-    this.idCounter = 0; // To generate predictable IDs
-  }
+  constructor() {}
 
   async save(invoice) {
killedBy: Invoices API E2E POST /api/invoices should create a new invoice
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryInvoiceRepository.js:11:23
     this.idCounter = 0; // To generate predictable IDs
   }
 
-  async save(invoice) {
-    this.invoices.set(invoice.id, invoice);
-    return invoice;
-  }
+  async save(invoice) {}
 
   async findById(id) {
killedBy: Invoices API E2E GET /api/invoices/:id should retrieve an invoice by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryInvoiceRepository.js:16:22
     return invoice;
   }
 
-  async findById(id) {
-    return this.invoices.get(id) || null;
-  }
+  async findById(id) {}
 
   async findAll() {
killedBy: Invoices API E2E GET /api/invoices/:id should retrieve an invoice by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/repositories/InMemoryInvoiceRepository.js:17:12
   }
 
   async findById(id) {
-    return this.invoices.get(id) || null;
+    return true;
   }
 
killedBy: Invoices API E2E GET /api/invoices/:id should retrieve an invoice by id
statusReason: expected 400 to be 200 // Object.is equality

[Killed] LogicalOperator
src/infrastructure/repositories/InMemoryInvoiceRepository.js:17:12
   }
 
   async findById(id) {
-    return this.invoices.get(id) || null;
+    return this.invoices.get(id) && null;
   }
 
killedBy: Invoices API E2E GET /api/invoices/:id should retrieve an invoice by id
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryInvoiceRepository.js:20:19
     return this.invoices.get(id) || null;
   }
 
-  async findAll() {
-    return Array.from(this.invoices.values());
-  }
+  async findAll() {}
 
   async findByFilters({ status, startDate, endDate, clientId }) {
killedBy: Invoices API E2E GET /api/invoices should list all invoices
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryInvoiceRepository.js:24:65
     return Array.from(this.invoices.values());
   }
 
-  async findByFilters({ status, startDate, endDate, clientId }) {
-    let invoices = Array.from(this.invoices.values());
-
-    if (status) {
-      invoices = invoices.filter(inv => inv.status === status);
-    }
-
-    if (clientId) {
-      invoices = invoices.filter(inv => inv.clientId === clientId);
-    }
-
-    if (startDate) {
-      invoices = invoices.filter(inv => new Date(inv.date) >= new Date(startDate));
-    }
-
-    if (endDate) {
-      invoices = invoices.filter(inv => new Date(inv.date) <= new Date(endDate));
-    }
-
-    return invoices;
-  }
+  async findByFilters({ status, startDate, endDate, clientId }) {}
 
   async getNextInvoiceNumber(year) {
killedBy: Invoices API E2E GET /api/invoices should filter invoices by status
statusReason: expected 400 to be 200 // Object.is equality

[Killed] MethodExpression
src/infrastructure/repositories/InMemoryInvoiceRepository.js:28:18
     let invoices = Array.from(this.invoices.values());
 
     if (status) {
-      invoices = invoices.filter(inv => inv.status === status);
+      invoices = invoices;
     }
 
killedBy: InMemoryInvoiceRepository findByFilters should filter by status
statusReason: expected [ Invoice{ id: '1', …(8) }, …(2) ] to have a length of 2 but got 3

[Killed] ArrowFunction
src/infrastructure/repositories/InMemoryInvoiceRepository.js:28:34
     let invoices = Array.from(this.invoices.values());
 
     if (status) {
-      invoices = invoices.filter(inv => inv.status === status);
+      invoices = invoices.filter(() => undefined);
     }
 
killedBy: InMemoryInvoiceRepository findByFilters should filter by status
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/infrastructure/repositories/InMemoryInvoiceRepository.js:31:9
       invoices = invoices.filter(inv => inv.status === status);
     }
 
-    if (clientId) {
+    if (false) {
       invoices = invoices.filter(inv => inv.clientId === clientId);
     }
killedBy: InMemoryInvoiceRepository findByFilters should filter by clientId
statusReason: expected [ Invoice{ id: '1', …(8) }, …(2) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/infrastructure/repositories/InMemoryInvoiceRepository.js:31:9
       invoices = invoices.filter(inv => inv.status === status);
     }
 
-    if (clientId) {
+    if (true) {
       invoices = invoices.filter(inv => inv.clientId === clientId);
     }
killedBy: InMemoryInvoiceRepository findByFilters should filter by status
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
src/infrastructure/repositories/InMemoryInvoiceRepository.js:32:18
     }
 
     if (clientId) {
-      invoices = invoices.filter(inv => inv.clientId === clientId);
+      invoices = invoices;
     }
 
killedBy: InMemoryInvoiceRepository findByFilters should filter by clientId
statusReason: expected [ Invoice{ id: '1', …(8) }, …(2) ] to have a length of 2 but got 3

[Killed] ArrowFunction
src/infrastructure/repositories/InMemoryInvoiceRepository.js:32:34
     }
 
     if (clientId) {
-      invoices = invoices.filter(inv => inv.clientId === clientId);
+      invoices = invoices.filter(() => undefined);
     }
 
killedBy: InMemoryInvoiceRepository findByFilters should filter by clientId
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryInvoiceRepository.js:35:20
       invoices = invoices.filter(inv => inv.clientId === clientId);
     }
 
-    if (startDate) {
-      invoices = invoices.filter(inv => new Date(inv.date) >= new Date(startDate));
-    }
+    if (startDate) {}
 
     if (endDate) {
killedBy: InMemoryInvoiceRepository findByFilters should filter by startDate
statusReason: expected [ Invoice{ id: '1', …(8) }, …(2) ] to have a length of 2 but got 3

[Killed] ArrowFunction
src/infrastructure/repositories/InMemoryInvoiceRepository.js:36:34
     }
 
     if (startDate) {
-      invoices = invoices.filter(inv => new Date(inv.date) >= new Date(startDate));
+      invoices = invoices.filter(() => undefined);
     }
 
killedBy: InMemoryInvoiceRepository findByFilters should filter by startDate
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
src/infrastructure/repositories/InMemoryInvoiceRepository.js:36:18
     }
 
     if (startDate) {
-      invoices = invoices.filter(inv => new Date(inv.date) >= new Date(startDate));
+      invoices = invoices;
     }
 
killedBy: InMemoryInvoiceRepository findByFilters should filter by startDate
statusReason: expected [ Invoice{ id: '1', …(8) }, …(2) ] to have a length of 2 but got 3

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryInvoiceRepository.js:39:18
       invoices = invoices.filter(inv => new Date(inv.date) >= new Date(startDate));
     }
 
-    if (endDate) {
-      invoices = invoices.filter(inv => new Date(inv.date) <= new Date(endDate));
-    }
+    if (endDate) {}
 
     return invoices;
killedBy: InMemoryInvoiceRepository findByFilters should filter by endDate
statusReason: expected [ Invoice{ id: '1', …(8) }, …(2) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/infrastructure/repositories/InMemoryInvoiceRepository.js:39:9
       invoices = invoices.filter(inv => new Date(inv.date) >= new Date(startDate));
     }
 
-    if (endDate) {
+    if (false) {
       invoices = invoices.filter(inv => new Date(inv.date) <= new Date(endDate));
     }
killedBy: InMemoryInvoiceRepository findByFilters should filter by endDate
statusReason: expected [ Invoice{ id: '1', …(8) }, …(2) ] to have a length of 2 but got 3

[Killed] EqualityOperator
src/infrastructure/repositories/InMemoryInvoiceRepository.js:40:41
     }
 
     if (endDate) {
-      invoices = invoices.filter(inv => new Date(inv.date) <= new Date(endDate));
+      invoices = invoices.filter(inv => new Date(inv.date) > new Date(endDate));
     }
 
killedBy: InMemoryInvoiceRepository findByFilters should filter by endDate
statusReason: expected [ Invoice{ id: '3', …(8) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/infrastructure/repositories/InMemoryInvoiceRepository.js:40:41
     }
 
     if (endDate) {
-      invoices = invoices.filter(inv => new Date(inv.date) <= new Date(endDate));
+      invoices = invoices.filter(inv => false);
     }
 
killedBy: InMemoryInvoiceRepository findByFilters should filter by endDate
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryInvoiceRepository.js:46:36
     return invoices;
   }
 
-  async getNextInvoiceNumber(year) {
-    const currentCount = this.invoiceCounters.get(year) || 0;
-    const nextCount = currentCount + 1;
-    this.invoiceCounters.set(year, nextCount);
-
-    // Format: INV-YYYY-001
-    const paddedNumber = String(nextCount).padStart(3, '0');
-    return `INV-${year}-${paddedNumber}`;
-  }
+  async getNextInvoiceNumber(year) {}
 
   getNextId() {
killedBy: InMemoryInvoiceRepository getNextInvoiceNumber should generate first invoice number for year
statusReason: expected undefined to be 'INV-2025-001' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/repositories/InMemoryInvoiceRepository.js:47:26
   }
 
   async getNextInvoiceNumber(year) {
-    const currentCount = this.invoiceCounters.get(year) || 0;
+    const currentCount = true;
     const nextCount = currentCount + 1;
     this.invoiceCounters.set(year, nextCount);
killedBy: InMemoryInvoiceRepository getNextInvoiceNumber should generate first invoice number for year
statusReason: expected 'INV-2025-002' to be 'INV-2025-001' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/repositories/InMemoryInvoiceRepository.js:47:26
   }
 
   async getNextInvoiceNumber(year) {
-    const currentCount = this.invoiceCounters.get(year) || 0;
+    const currentCount = this.invoiceCounters.get(year) && 0;
     const nextCount = currentCount + 1;
     this.invoiceCounters.set(year, nextCount);
killedBy: InMemoryInvoiceRepository getNextInvoiceNumber should generate first invoice number for year
statusReason: expected 'INV-2025-NaN' to be 'INV-2025-001' // Object.is equality

[Killed] ArithmeticOperator
src/infrastructure/repositories/InMemoryInvoiceRepository.js:48:23
 
   async getNextInvoiceNumber(year) {
     const currentCount = this.invoiceCounters.get(year) || 0;
-    const nextCount = currentCount + 1;
+    const nextCount = currentCount - 1;
     this.invoiceCounters.set(year, nextCount);
 
killedBy: InMemoryInvoiceRepository getNextInvoiceNumber should generate first invoice number for year
statusReason: expected 'INV-2025-0-1' to be 'INV-2025-001' // Object.is equality

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryInvoiceRepository.js:56:15
     return `INV-${year}-${paddedNumber}`;
   }
 
-  getNextId() {
-    this.idCounter++;
-    return `invoice-${this.idCounter}`;
-  }
+  getNextId() {}
 
   // Useful method for tests
killedBy: InMemoryInvoiceRepository getNextId should generate sequential IDs
statusReason: expected undefined to be 'invoice-1' // Object.is equality

[Killed] UpdateOperator
src/infrastructure/repositories/InMemoryInvoiceRepository.js:57:5
   }
 
   getNextId() {
-    this.idCounter++;
+    this.idCounter--;
     return `invoice-${this.idCounter}`;
   }
killedBy: InMemoryInvoiceRepository getNextId should generate sequential IDs
statusReason: expected 'invoice--1' to be 'invoice-1' // Object.is equality

[Killed] BlockStatement
src/infrastructure/repositories/InMemoryInvoiceRepository.js:62:11
   }
 
   // Useful method for tests
-  clear() {
-    this.invoices.clear();
-    this.invoiceCounters.clear();
-    this.idCounter = 0;
-  }
+  clear() {}
 }
 
killedBy: InMemoryInvoiceRepository clear should clear all invoices
statusReason: expected [ Invoice{ id: '123', …(8) } ] to have a length of +0 but got 1
